SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_timer.h
/* Bit fields for TIMER CFG */
#define _TIMER_CFG_RESETVALUE                   0x00000000UL                            /**< Default value for TIMER_CFG                 */
#define _TIMER_CFG_MASK                         0x0FFF1FFBUL                            /**< Mask for TIMER_CFG                          */
#define _TIMER_CFG_MODE_SHIFT                   0                                       /**< Shift value for TIMER_MODE                  */
#define _TIMER_CFG_MODE_MASK                    0x3UL                                   /**< Bit mask for TIMER_MODE                     */
#define _TIMER_CFG_MODE_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for TIMER_CFG                  */
#define _TIMER_CFG_MODE_UP                      0x00000000UL                            /**< Mode UP for TIMER_CFG                       */
#define _TIMER_CFG_MODE_DOWN                    0x00000001UL                            /**< Mode DOWN for TIMER_CFG                     */
#define _TIMER_CFG_MODE_UPDOWN                  0x00000002UL                            /**< Mode UPDOWN for TIMER_CFG                   */
#define _TIMER_CFG_MODE_QDEC                    0x00000003UL                            /**< Mode QDEC for TIMER_CFG                     */
#define TIMER_CFG_MODE_DEFAULT                  (_TIMER_CFG_MODE_DEFAULT << 0)          /**< Shifted mode DEFAULT for TIMER_CFG          */
#define TIMER_CFG_MODE_UP                       (_TIMER_CFG_MODE_UP << 0)               /**< Shifted mode UP for TIMER_CFG               */
#define TIMER_CFG_MODE_DOWN                     (_TIMER_CFG_MODE_DOWN << 0)             /**< Shifted mode DOWN for TIMER_CFG             */
#define TIMER_CFG_MODE_UPDOWN                   (_TIMER_CFG_MODE_UPDOWN << 0)           /**< Shifted mode UPDOWN for TIMER_CFG           */
#define TIMER_CFG_MODE_QDEC                     (_TIMER_CFG_MODE_QDEC << 0)             /**< Shifted mode QDEC for TIMER_CFG             */
#define TIMER_CFG_SYNC                          (0x1UL << 3)                            /**< Timer Start/Stop/Reload Synchronization     */
#define _TIMER_CFG_SYNC_SHIFT                   3                                       /**< Shift value for TIMER_SYNC                  */
#define _TIMER_CFG_SYNC_MASK                    0x8UL                                   /**< Bit mask for TIMER_SYNC                     */
#define _TIMER_CFG_SYNC_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for TIMER_CFG                  */
#define _TIMER_CFG_SYNC_DISABLE                 0x00000000UL                            /**< Mode DISABLE for TIMER_CFG                  */
#define _TIMER_CFG_SYNC_ENABLE                  0x00000001UL                            /**< Mode ENABLE for TIMER_CFG                   */
#define TIMER_CFG_SYNC_DEFAULT                  (_TIMER_CFG_SYNC_DEFAULT << 3)          /**< Shifted mode DEFAULT for TIMER_CFG          */
#define TIMER_CFG_SYNC_DISABLE                  (_TIMER_CFG_SYNC_DISABLE << 3)          /**< Shifted mode DISABLE for TIMER_CFG          */
#define TIMER_CFG_SYNC_ENABLE                   (_TIMER_CFG_SYNC_ENABLE << 3)           /**< Shifted mode ENABLE for TIMER_CFG           */
#define TIMER_CFG_OSMEN                         (0x1UL << 4)                            /**< One-shot Mode Enable                        */
#define _TIMER_CFG_OSMEN_SHIFT                  4                                       /**< Shift value for TIMER_OSMEN                 */
#define _TIMER_CFG_OSMEN_MASK                   0x10UL                                  /**< Bit mask for TIMER_OSMEN                    */
#define _TIMER_CFG_OSMEN_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TIMER_CFG                  */
#define TIMER_CFG_OSMEN_DEFAULT                 (_TIMER_CFG_OSMEN_DEFAULT << 4)         /**< Shifted mode DEFAULT for TIMER_CFG          */
#define TIMER_CFG_QDM                           (0x1UL << 5)                            /**< Quadrature Decoder Mode Selection           */
#define _TIMER_CFG_QDM_SHIFT                    5                                       /**< Shift value for TIMER_QDM                   */
#define _TIMER_CFG_QDM_MASK                     0x20UL                                  /**< Bit mask for TIMER_QDM                      */
#define _TIMER_CFG_QDM_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for TIMER_CFG                  */
#define _TIMER_CFG_QDM_X2                       0x00000000UL                            /**< Mode X2 for TIMER_CFG                       */
#define _TIMER_CFG_QDM_X4                       0x00000001UL                            /**< Mode X4 for TIMER_CFG                       */
#define TIMER_CFG_QDM_DEFAULT                   (_TIMER_CFG_QDM_DEFAULT << 5)           /**< Shifted mode DEFAULT for TIMER_CFG          */
#define TIMER_CFG_QDM_X2                        (_TIMER_CFG_QDM_X2 << 5)                /**< Shifted mode X2 for TIMER_CFG               */
#define TIMER_CFG_QDM_X4                        (_TIMER_CFG_QDM_X4 << 5)                /**< Shifted mode X4 for TIMER_CFG               */
#define TIMER_CFG_DEBUGRUN                      (0x1UL << 6)                            /**< Debug Mode Run Enable                       */
#define _TIMER_CFG_DEBUGRUN_SHIFT               6                                       /**< Shift value for TIMER_DEBUGRUN              */
#define _TIMER_CFG_DEBUGRUN_MASK                0x40UL                                  /**< Bit mask for TIMER_DEBUGRUN                 */
#define _TIMER_CFG_DEBUGRUN_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for TIMER_CFG                  */
#define _TIMER_CFG_DEBUGRUN_HALT                0x00000000UL                            /**< Mode HALT for TIMER_CFG                     */
#define _TIMER_CFG_DEBUGRUN_RUN                 0x00000001UL                            /**< Mode RUN for TIMER_CFG                      */
#define TIMER_CFG_DEBUGRUN_DEFAULT              (_TIMER_CFG_DEBUGRUN_DEFAULT << 6)      /**< Shifted mode DEFAULT for TIMER_CFG          */
#define TIMER_CFG_DEBUGRUN_HALT                 (_TIMER_CFG_DEBUGRUN_HALT << 6)         /**< Shifted mode HALT for TIMER_CFG             */
#define TIMER_CFG_DEBUGRUN_RUN                  (_TIMER_CFG_DEBUGRUN_RUN << 6)          /**< Shifted mode RUN for TIMER_CFG              */
#define TIMER_CFG_DMACLRACT                     (0x1UL << 7)                            /**< DMA Request Clear on Active                 */
#define _TIMER_CFG_DMACLRACT_SHIFT              7                                       /**< Shift value for TIMER_DMACLRACT             */
#define _TIMER_CFG_DMACLRACT_MASK               0x80UL                                  /**< Bit mask for TIMER_DMACLRACT                */
#define _TIMER_CFG_DMACLRACT_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for TIMER_CFG                  */
#define TIMER_CFG_DMACLRACT_DEFAULT             (_TIMER_CFG_DMACLRACT_DEFAULT << 7)     /**< Shifted mode DEFAULT for TIMER_CFG          */
#define _TIMER_CFG_CLKSEL_SHIFT                 8                                       /**< Shift value for TIMER_CLKSEL                */
#define _TIMER_CFG_CLKSEL_MASK                  0x300UL                                 /**< Bit mask for TIMER_CLKSEL                   */
#define _TIMER_CFG_CLKSEL_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TIMER_CFG                  */
#define _TIMER_CFG_CLKSEL_PRESCEM01GRPACLK      0x00000000UL                            /**< Mode PRESCEM01GRPACLK for TIMER_CFG         */
#define _TIMER_CFG_CLKSEL_CC1                   0x00000001UL                            /**< Mode CC1 for TIMER_CFG                      */
#define _TIMER_CFG_CLKSEL_TIMEROUF              0x00000002UL                            /**< Mode TIMEROUF for TIMER_CFG                 */
#define TIMER_CFG_CLKSEL_DEFAULT                (_TIMER_CFG_CLKSEL_DEFAULT << 8)        /**< Shifted mode DEFAULT for TIMER_CFG          */
#define TIMER_CFG_CLKSEL_PRESCEM01GRPACLK       (_TIMER_CFG_CLKSEL_PRESCEM01GRPACLK << 8) /**< Shifted mode PRESCEM01GRPACLK for TIMER_CFG */
#define TIMER_CFG_CLKSEL_CC1                    (_TIMER_CFG_CLKSEL_CC1 << 8)            /**< Shifted mode CC1 for TIMER_CFG              */
#define TIMER_CFG_CLKSEL_TIMEROUF               (_TIMER_CFG_CLKSEL_TIMEROUF << 8)       /**< Shifted mode TIMEROUF for TIMER_CFG         */
#define TIMER_CFG_RETIMEEN                      (0x1UL << 10)                           /**< PWM output retimed enable                   */
#define _TIMER_CFG_RETIMEEN_SHIFT               10                                      /**< Shift value for TIMER_RETIMEEN              */
#define _TIMER_CFG_RETIMEEN_MASK                0x400UL                                 /**< Bit mask for TIMER_RETIMEEN                 */
#define _TIMER_CFG_RETIMEEN_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for TIMER_CFG                  */
#define _TIMER_CFG_RETIMEEN_DISABLE             0x00000000UL                            /**< Mode DISABLE for TIMER_CFG                  */
#define _TIMER_CFG_RETIMEEN_ENABLE              0x00000001UL                            /**< Mode ENABLE for TIMER_CFG                   */
#define TIMER_CFG_RETIMEEN_DEFAULT              (_TIMER_CFG_RETIMEEN_DEFAULT << 10)     /**< Shifted mode DEFAULT for TIMER_CFG          */
#define TIMER_CFG_RETIMEEN_DISABLE              (_TIMER_CFG_RETIMEEN_DISABLE << 10)     /**< Shifted mode DISABLE for TIMER_CFG          */
#define TIMER_CFG_RETIMEEN_ENABLE               (_TIMER_CFG_RETIMEEN_ENABLE << 10)      /**< Shifted mode ENABLE for TIMER_CFG           */
#define TIMER_CFG_DISSYNCOUT                    (0x1UL << 11)                           /**< Disable Timer Start/Stop/Reload output      */
#define _TIMER_CFG_DISSYNCOUT_SHIFT             11                                      /**< Shift value for TIMER_DISSYNCOUT            */
#define _TIMER_CFG_DISSYNCOUT_MASK              0x800UL                                 /**< Bit mask for TIMER_DISSYNCOUT               */
#define _TIMER_CFG_DISSYNCOUT_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for TIMER_CFG                  */
#define _TIMER_CFG_DISSYNCOUT_EN                0x00000000UL                            /**< Mode EN for TIMER_CFG                       */
#define _TIMER_CFG_DISSYNCOUT_DIS               0x00000001UL                            /**< Mode DIS for TIMER_CFG                      */
#define TIMER_CFG_DISSYNCOUT_DEFAULT            (_TIMER_CFG_DISSYNCOUT_DEFAULT << 11)   /**< Shifted mode DEFAULT for TIMER_CFG          */
#define TIMER_CFG_DISSYNCOUT_EN                 (_TIMER_CFG_DISSYNCOUT_EN << 11)        /**< Shifted mode EN for TIMER_CFG               */
#define TIMER_CFG_DISSYNCOUT_DIS                (_TIMER_CFG_DISSYNCOUT_DIS << 11)       /**< Shifted mode DIS for TIMER_CFG              */
#define TIMER_CFG_RETIMESEL                     (0x1UL << 12)                           /**< PWM output retime select                    */
#define _TIMER_CFG_RETIMESEL_SHIFT              12                                      /**< Shift value for TIMER_RETIMESEL             */
#define _TIMER_CFG_RETIMESEL_MASK               0x1000UL                                /**< Bit mask for TIMER_RETIMESEL                */
#define _TIMER_CFG_RETIMESEL_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for TIMER_CFG                  */
#define TIMER_CFG_RETIMESEL_DEFAULT             (_TIMER_CFG_RETIMESEL_DEFAULT << 12)    /**< Shifted mode DEFAULT for TIMER_CFG          */
#define TIMER_CFG_ATI                           (0x1UL << 16)                           /**< Always Track Inputs                         */
#define _TIMER_CFG_ATI_SHIFT                    16                                      /**< Shift value for TIMER_ATI                   */
#define _TIMER_CFG_ATI_MASK                     0x10000UL                               /**< Bit mask for TIMER_ATI                      */
#define _TIMER_CFG_ATI_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for TIMER_CFG                  */
#define TIMER_CFG_ATI_DEFAULT                   (_TIMER_CFG_ATI_DEFAULT << 16)          /**< Shifted mode DEFAULT for TIMER_CFG          */
#define TIMER_CFG_RSSCOIST                      (0x1UL << 17)                           /**< Reload-Start Sets COIST                     */
#define _TIMER_CFG_RSSCOIST_SHIFT               17                                      /**< Shift value for TIMER_RSSCOIST              */
#define _TIMER_CFG_RSSCOIST_MASK                0x20000UL                               /**< Bit mask for TIMER_RSSCOIST                 */
#define _TIMER_CFG_RSSCOIST_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for TIMER_CFG                  */
#define TIMER_CFG_RSSCOIST_DEFAULT              (_TIMER_CFG_RSSCOIST_DEFAULT << 17)     /**< Shifted mode DEFAULT for TIMER_CFG          */
#define _TIMER_CFG_PRESC_SHIFT                  18                                      /**< Shift value for TIMER_PRESC                 */
#define _TIMER_CFG_PRESC_MASK                   0xFFC0000UL                             /**< Bit mask for TIMER_PRESC                    */
#define _TIMER_CFG_PRESC_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TIMER_CFG                  */
#define _TIMER_CFG_PRESC_DIV1                   0x00000000UL                            /**< Mode DIV1 for TIMER_CFG                     */
#define _TIMER_CFG_PRESC_DIV2                   0x00000001UL                            /**< Mode DIV2 for TIMER_CFG                     */
#define _TIMER_CFG_PRESC_DIV4                   0x00000003UL                            /**< Mode DIV4 for TIMER_CFG                     */
#define _TIMER_CFG_PRESC_DIV8                   0x00000007UL                            /**< Mode DIV8 for TIMER_CFG                     */
#define _TIMER_CFG_PRESC_DIV16                  0x0000000FUL                            /**< Mode DIV16 for TIMER_CFG                    */
#define _TIMER_CFG_PRESC_DIV32                  0x0000001FUL                            /**< Mode DIV32 for TIMER_CFG                    */
#define _TIMER_CFG_PRESC_DIV64                  0x0000003FUL                            /**< Mode DIV64 for TIMER_CFG                    */
#define _TIMER_CFG_PRESC_DIV128                 0x0000007FUL                            /**< Mode DIV128 for TIMER_CFG                   */
#define _TIMER_CFG_PRESC_DIV256                 0x000000FFUL                            /**< Mode DIV256 for TIMER_CFG                   */
#define _TIMER_CFG_PRESC_DIV512                 0x000001FFUL                            /**< Mode DIV512 for TIMER_CFG                   */
#define _TIMER_CFG_PRESC_DIV1024                0x000003FFUL                            /**< Mode DIV1024 for TIMER_CFG                  */
#define TIMER_CFG_PRESC_DEFAULT                 (_TIMER_CFG_PRESC_DEFAULT << 18)        /**< Shifted mode DEFAULT for TIMER_CFG          */
#define TIMER_CFG_PRESC_DIV1                    (_TIMER_CFG_PRESC_DIV1 << 18)           /**< Shifted mode DIV1 for TIMER_CFG             */
#define TIMER_CFG_PRESC_DIV2                    (_TIMER_CFG_PRESC_DIV2 << 18)           /**< Shifted mode DIV2 for TIMER_CFG             */
#define TIMER_CFG_PRESC_DIV4                    (_TIMER_CFG_PRESC_DIV4 << 18)           /**< Shifted mode DIV4 for TIMER_CFG             */
#define TIMER_CFG_PRESC_DIV8                    (_TIMER_CFG_PRESC_DIV8 << 18)           /**< Shifted mode DIV8 for TIMER_CFG             */
#define TIMER_CFG_PRESC_DIV16                   (_TIMER_CFG_PRESC_DIV16 << 18)          /**< Shifted mode DIV16 for TIMER_CFG            */
#define TIMER_CFG_PRESC_DIV32                   (_TIMER_CFG_PRESC_DIV32 << 18)          /**< Shifted mode DIV32 for TIMER_CFG            */
#define TIMER_CFG_PRESC_DIV64                   (_TIMER_CFG_PRESC_DIV64 << 18)          /**< Shifted mode DIV64 for TIMER_CFG            */
#define TIMER_CFG_PRESC_DIV128                  (_TIMER_CFG_PRESC_DIV128 << 18)         /**< Shifted mode DIV128 for TIMER_CFG           */
#define TIMER_CFG_PRESC_DIV256                  (_TIMER_CFG_PRESC_DIV256 << 18)         /**< Shifted mode DIV256 for TIMER_CFG           */
#define TIMER_CFG_PRESC_DIV512                  (_TIMER_CFG_PRESC_DIV512 << 18)         /**< Shifted mode DIV512 for TIMER_CFG           */
#define TIMER_CFG_PRESC_DIV1024                 (_TIMER_CFG_PRESC_DIV1024 << 18)        /**< Shifted mode DIV1024 for TIMER_CFG          */

