SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_timer.h
/* Bit fields for TIMER IF */
#define _TIMER_IF_RESETVALUE                    0x00000000UL                            /**< Default value for TIMER_IF                  */
#define _TIMER_IF_MASK                          0x07770077UL                            /**< Mask for TIMER_IF                           */
#define TIMER_IF_OF                             (0x1UL << 0)                            /**< Overflow Interrupt Flag                     */
#define _TIMER_IF_OF_SHIFT                      0                                       /**< Shift value for TIMER_OF                    */
#define _TIMER_IF_OF_MASK                       0x1UL                                   /**< Bit mask for TIMER_OF                       */
#define _TIMER_IF_OF_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for TIMER_IF                   */
#define TIMER_IF_OF_DEFAULT                     (_TIMER_IF_OF_DEFAULT << 0)             /**< Shifted mode DEFAULT for TIMER_IF           */
#define TIMER_IF_UF                             (0x1UL << 1)                            /**< Underflow Interrupt Flag                    */
#define _TIMER_IF_UF_SHIFT                      1                                       /**< Shift value for TIMER_UF                    */
#define _TIMER_IF_UF_MASK                       0x2UL                                   /**< Bit mask for TIMER_UF                       */
#define _TIMER_IF_UF_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for TIMER_IF                   */
#define TIMER_IF_UF_DEFAULT                     (_TIMER_IF_UF_DEFAULT << 1)             /**< Shifted mode DEFAULT for TIMER_IF           */
#define TIMER_IF_DIRCHG                         (0x1UL << 2)                            /**< Direction Change Detect Interrupt Flag      */
#define _TIMER_IF_DIRCHG_SHIFT                  2                                       /**< Shift value for TIMER_DIRCHG                */
#define _TIMER_IF_DIRCHG_MASK                   0x4UL                                   /**< Bit mask for TIMER_DIRCHG                   */
#define _TIMER_IF_DIRCHG_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TIMER_IF                   */
#define TIMER_IF_DIRCHG_DEFAULT                 (_TIMER_IF_DIRCHG_DEFAULT << 2)         /**< Shifted mode DEFAULT for TIMER_IF           */
#define TIMER_IF_CC0                            (0x1UL << 4)                            /**< Capture Compare Channel 0 Interrupt Flag    */
#define _TIMER_IF_CC0_SHIFT                     4                                       /**< Shift value for TIMER_CC0                   */
#define _TIMER_IF_CC0_MASK                      0x10UL                                  /**< Bit mask for TIMER_CC0                      */
#define _TIMER_IF_CC0_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for TIMER_IF                   */
#define TIMER_IF_CC0_DEFAULT                    (_TIMER_IF_CC0_DEFAULT << 4)            /**< Shifted mode DEFAULT for TIMER_IF           */
#define TIMER_IF_CC1                            (0x1UL << 5)                            /**< Capture Compare Channel 1 Interrupt Flag    */
#define _TIMER_IF_CC1_SHIFT                     5                                       /**< Shift value for TIMER_CC1                   */
#define _TIMER_IF_CC1_MASK                      0x20UL                                  /**< Bit mask for TIMER_CC1                      */
#define _TIMER_IF_CC1_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for TIMER_IF                   */
#define TIMER_IF_CC1_DEFAULT                    (_TIMER_IF_CC1_DEFAULT << 5)            /**< Shifted mode DEFAULT for TIMER_IF           */
#define TIMER_IF_CC2                            (0x1UL << 6)                            /**< Capture Compare Channel 2 Interrupt Flag    */
#define _TIMER_IF_CC2_SHIFT                     6                                       /**< Shift value for TIMER_CC2                   */
#define _TIMER_IF_CC2_MASK                      0x40UL                                  /**< Bit mask for TIMER_CC2                      */
#define _TIMER_IF_CC2_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for TIMER_IF                   */
#define TIMER_IF_CC2_DEFAULT                    (_TIMER_IF_CC2_DEFAULT << 6)            /**< Shifted mode DEFAULT for TIMER_IF           */
#define TIMER_IF_ICFWLFULL0                     (0x1UL << 16)                           /**< Input Capture Watermark Level Full          */
#define _TIMER_IF_ICFWLFULL0_SHIFT              16                                      /**< Shift value for TIMER_ICFWLFULL0            */
#define _TIMER_IF_ICFWLFULL0_MASK               0x10000UL                               /**< Bit mask for TIMER_ICFWLFULL0               */
#define _TIMER_IF_ICFWLFULL0_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for TIMER_IF                   */
#define TIMER_IF_ICFWLFULL0_DEFAULT             (_TIMER_IF_ICFWLFULL0_DEFAULT << 16)    /**< Shifted mode DEFAULT for TIMER_IF           */
#define TIMER_IF_ICFWLFULL1                     (0x1UL << 17)                           /**< Input Capture Watermark Level Full          */
#define _TIMER_IF_ICFWLFULL1_SHIFT              17                                      /**< Shift value for TIMER_ICFWLFULL1            */
#define _TIMER_IF_ICFWLFULL1_MASK               0x20000UL                               /**< Bit mask for TIMER_ICFWLFULL1               */
#define _TIMER_IF_ICFWLFULL1_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for TIMER_IF                   */
#define TIMER_IF_ICFWLFULL1_DEFAULT             (_TIMER_IF_ICFWLFULL1_DEFAULT << 17)    /**< Shifted mode DEFAULT for TIMER_IF           */
#define TIMER_IF_ICFWLFULL2                     (0x1UL << 18)                           /**< Input Capture Watermark Level Full          */
#define _TIMER_IF_ICFWLFULL2_SHIFT              18                                      /**< Shift value for TIMER_ICFWLFULL2            */
#define _TIMER_IF_ICFWLFULL2_MASK               0x40000UL                               /**< Bit mask for TIMER_ICFWLFULL2               */
#define _TIMER_IF_ICFWLFULL2_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for TIMER_IF                   */
#define TIMER_IF_ICFWLFULL2_DEFAULT             (_TIMER_IF_ICFWLFULL2_DEFAULT << 18)    /**< Shifted mode DEFAULT for TIMER_IF           */
#define TIMER_IF_ICFOF0                         (0x1UL << 20)                           /**< Input Capture FIFO overflow                 */
#define _TIMER_IF_ICFOF0_SHIFT                  20                                      /**< Shift value for TIMER_ICFOF0                */
#define _TIMER_IF_ICFOF0_MASK                   0x100000UL                              /**< Bit mask for TIMER_ICFOF0                   */
#define _TIMER_IF_ICFOF0_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TIMER_IF                   */
#define TIMER_IF_ICFOF0_DEFAULT                 (_TIMER_IF_ICFOF0_DEFAULT << 20)        /**< Shifted mode DEFAULT for TIMER_IF           */
#define TIMER_IF_ICFOF1                         (0x1UL << 21)                           /**< Input Capture FIFO overflow                 */
#define _TIMER_IF_ICFOF1_SHIFT                  21                                      /**< Shift value for TIMER_ICFOF1                */
#define _TIMER_IF_ICFOF1_MASK                   0x200000UL                              /**< Bit mask for TIMER_ICFOF1                   */
#define _TIMER_IF_ICFOF1_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TIMER_IF                   */
#define TIMER_IF_ICFOF1_DEFAULT                 (_TIMER_IF_ICFOF1_DEFAULT << 21)        /**< Shifted mode DEFAULT for TIMER_IF           */
#define TIMER_IF_ICFOF2                         (0x1UL << 22)                           /**< Input Capture FIFO overflow                 */
#define _TIMER_IF_ICFOF2_SHIFT                  22                                      /**< Shift value for TIMER_ICFOF2                */
#define _TIMER_IF_ICFOF2_MASK                   0x400000UL                              /**< Bit mask for TIMER_ICFOF2                   */
#define _TIMER_IF_ICFOF2_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TIMER_IF                   */
#define TIMER_IF_ICFOF2_DEFAULT                 (_TIMER_IF_ICFOF2_DEFAULT << 22)        /**< Shifted mode DEFAULT for TIMER_IF           */
#define TIMER_IF_ICFUF0                         (0x1UL << 24)                           /**< Input capture FIFO underflow                */
#define _TIMER_IF_ICFUF0_SHIFT                  24                                      /**< Shift value for TIMER_ICFUF0                */
#define _TIMER_IF_ICFUF0_MASK                   0x1000000UL                             /**< Bit mask for TIMER_ICFUF0                   */
#define _TIMER_IF_ICFUF0_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TIMER_IF                   */
#define TIMER_IF_ICFUF0_DEFAULT                 (_TIMER_IF_ICFUF0_DEFAULT << 24)        /**< Shifted mode DEFAULT for TIMER_IF           */
#define TIMER_IF_ICFUF1                         (0x1UL << 25)                           /**< Input capture FIFO underflow                */
#define _TIMER_IF_ICFUF1_SHIFT                  25                                      /**< Shift value for TIMER_ICFUF1                */
#define _TIMER_IF_ICFUF1_MASK                   0x2000000UL                             /**< Bit mask for TIMER_ICFUF1                   */
#define _TIMER_IF_ICFUF1_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TIMER_IF                   */
#define TIMER_IF_ICFUF1_DEFAULT                 (_TIMER_IF_ICFUF1_DEFAULT << 25)        /**< Shifted mode DEFAULT for TIMER_IF           */
#define TIMER_IF_ICFUF2                         (0x1UL << 26)                           /**< Input capture FIFO underflow                */
#define _TIMER_IF_ICFUF2_SHIFT                  26                                      /**< Shift value for TIMER_ICFUF2                */
#define _TIMER_IF_ICFUF2_MASK                   0x4000000UL                             /**< Bit mask for TIMER_ICFUF2                   */
#define _TIMER_IF_ICFUF2_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TIMER_IF                   */
#define TIMER_IF_ICFUF2_DEFAULT                 (_TIMER_IF_ICFUF2_DEFAULT << 26)        /**< Shifted mode DEFAULT for TIMER_IF           */

/* Bit fields for TIMER IEN */
#define _TIMER_IEN_RESETVALUE                   0x00000000UL                            /**< Default value for TIMER_IEN                 */
#define _TIMER_IEN_MASK                         0x07770077UL                            /**< Mask for TIMER_IEN                          */
#define TIMER_IEN_OF                            (0x1UL << 0)                            /**< Overflow Interrupt Enable                   */
#define _TIMER_IEN_OF_SHIFT                     0                                       /**< Shift value for TIMER_OF                    */
#define _TIMER_IEN_OF_MASK                      0x1UL                                   /**< Bit mask for TIMER_OF                       */
#define _TIMER_IEN_OF_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for TIMER_IEN                  */
#define TIMER_IEN_OF_DEFAULT                    (_TIMER_IEN_OF_DEFAULT << 0)            /**< Shifted mode DEFAULT for TIMER_IEN          */
#define TIMER_IEN_UF                            (0x1UL << 1)                            /**< Underflow Interrupt Enable                  */
#define _TIMER_IEN_UF_SHIFT                     1                                       /**< Shift value for TIMER_UF                    */
#define _TIMER_IEN_UF_MASK                      0x2UL                                   /**< Bit mask for TIMER_UF                       */
#define _TIMER_IEN_UF_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for TIMER_IEN                  */
#define TIMER_IEN_UF_DEFAULT                    (_TIMER_IEN_UF_DEFAULT << 1)            /**< Shifted mode DEFAULT for TIMER_IEN          */
#define TIMER_IEN_DIRCHG                        (0x1UL << 2)                            /**< Direction Change Detect Interrupt Enable    */
#define _TIMER_IEN_DIRCHG_SHIFT                 2                                       /**< Shift value for TIMER_DIRCHG                */
#define _TIMER_IEN_DIRCHG_MASK                  0x4UL                                   /**< Bit mask for TIMER_DIRCHG                   */
#define _TIMER_IEN_DIRCHG_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TIMER_IEN                  */
#define TIMER_IEN_DIRCHG_DEFAULT                (_TIMER_IEN_DIRCHG_DEFAULT << 2)        /**< Shifted mode DEFAULT for TIMER_IEN          */
#define TIMER_IEN_CC0                           (0x1UL << 4)                            /**< CC0 Interrupt Enable                        */
#define _TIMER_IEN_CC0_SHIFT                    4                                       /**< Shift value for TIMER_CC0                   */
#define _TIMER_IEN_CC0_MASK                     0x10UL                                  /**< Bit mask for TIMER_CC0                      */
#define _TIMER_IEN_CC0_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for TIMER_IEN                  */
#define TIMER_IEN_CC0_DEFAULT                   (_TIMER_IEN_CC0_DEFAULT << 4)           /**< Shifted mode DEFAULT for TIMER_IEN          */
#define TIMER_IEN_CC1                           (0x1UL << 5)                            /**< CC1 Interrupt Enable                        */
#define _TIMER_IEN_CC1_SHIFT                    5                                       /**< Shift value for TIMER_CC1                   */
#define _TIMER_IEN_CC1_MASK                     0x20UL                                  /**< Bit mask for TIMER_CC1                      */
#define _TIMER_IEN_CC1_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for TIMER_IEN                  */
#define TIMER_IEN_CC1_DEFAULT                   (_TIMER_IEN_CC1_DEFAULT << 5)           /**< Shifted mode DEFAULT for TIMER_IEN          */
#define TIMER_IEN_CC2                           (0x1UL << 6)                            /**< CC2 Interrupt Enable                        */
#define _TIMER_IEN_CC2_SHIFT                    6                                       /**< Shift value for TIMER_CC2                   */
#define _TIMER_IEN_CC2_MASK                     0x40UL                                  /**< Bit mask for TIMER_CC2                      */
#define _TIMER_IEN_CC2_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for TIMER_IEN                  */
#define TIMER_IEN_CC2_DEFAULT                   (_TIMER_IEN_CC2_DEFAULT << 6)           /**< Shifted mode DEFAULT for TIMER_IEN          */
#define TIMER_IEN_ICFWLFULL0                    (0x1UL << 16)                           /**< ICFWLFULL0 Interrupt Enable                 */
#define _TIMER_IEN_ICFWLFULL0_SHIFT             16                                      /**< Shift value for TIMER_ICFWLFULL0            */
#define _TIMER_IEN_ICFWLFULL0_MASK              0x10000UL                               /**< Bit mask for TIMER_ICFWLFULL0               */
#define _TIMER_IEN_ICFWLFULL0_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for TIMER_IEN                  */
#define TIMER_IEN_ICFWLFULL0_DEFAULT            (_TIMER_IEN_ICFWLFULL0_DEFAULT << 16)   /**< Shifted mode DEFAULT for TIMER_IEN          */
#define TIMER_IEN_ICFWLFULL1                    (0x1UL << 17)                           /**< ICFWLFULL1 Interrupt Enable                 */
#define _TIMER_IEN_ICFWLFULL1_SHIFT             17                                      /**< Shift value for TIMER_ICFWLFULL1            */
#define _TIMER_IEN_ICFWLFULL1_MASK              0x20000UL                               /**< Bit mask for TIMER_ICFWLFULL1               */
#define _TIMER_IEN_ICFWLFULL1_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for TIMER_IEN                  */
#define TIMER_IEN_ICFWLFULL1_DEFAULT            (_TIMER_IEN_ICFWLFULL1_DEFAULT << 17)   /**< Shifted mode DEFAULT for TIMER_IEN          */
#define TIMER_IEN_ICFWLFULL2                    (0x1UL << 18)                           /**< ICFWLFULL2 Interrupt Enable                 */
#define _TIMER_IEN_ICFWLFULL2_SHIFT             18                                      /**< Shift value for TIMER_ICFWLFULL2            */
#define _TIMER_IEN_ICFWLFULL2_MASK              0x40000UL                               /**< Bit mask for TIMER_ICFWLFULL2               */
#define _TIMER_IEN_ICFWLFULL2_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for TIMER_IEN                  */
#define TIMER_IEN_ICFWLFULL2_DEFAULT            (_TIMER_IEN_ICFWLFULL2_DEFAULT << 18)   /**< Shifted mode DEFAULT for TIMER_IEN          */
#define TIMER_IEN_ICFOF0                        (0x1UL << 20)                           /**< ICFOF0 Interrupt Enable                     */
#define _TIMER_IEN_ICFOF0_SHIFT                 20                                      /**< Shift value for TIMER_ICFOF0                */
#define _TIMER_IEN_ICFOF0_MASK                  0x100000UL                              /**< Bit mask for TIMER_ICFOF0                   */
#define _TIMER_IEN_ICFOF0_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TIMER_IEN                  */
#define TIMER_IEN_ICFOF0_DEFAULT                (_TIMER_IEN_ICFOF0_DEFAULT << 20)       /**< Shifted mode DEFAULT for TIMER_IEN          */
#define TIMER_IEN_ICFOF1                        (0x1UL << 21)                           /**< ICFOF1 Interrupt Enable                     */
#define _TIMER_IEN_ICFOF1_SHIFT                 21                                      /**< Shift value for TIMER_ICFOF1                */
#define _TIMER_IEN_ICFOF1_MASK                  0x200000UL                              /**< Bit mask for TIMER_ICFOF1                   */
#define _TIMER_IEN_ICFOF1_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TIMER_IEN                  */
#define TIMER_IEN_ICFOF1_DEFAULT                (_TIMER_IEN_ICFOF1_DEFAULT << 21)       /**< Shifted mode DEFAULT for TIMER_IEN          */
#define TIMER_IEN_ICFOF2                        (0x1UL << 22)                           /**< ICFOF2 Interrupt Enable                     */
#define _TIMER_IEN_ICFOF2_SHIFT                 22                                      /**< Shift value for TIMER_ICFOF2                */
#define _TIMER_IEN_ICFOF2_MASK                  0x400000UL                              /**< Bit mask for TIMER_ICFOF2                   */
#define _TIMER_IEN_ICFOF2_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TIMER_IEN                  */
#define TIMER_IEN_ICFOF2_DEFAULT                (_TIMER_IEN_ICFOF2_DEFAULT << 22)       /**< Shifted mode DEFAULT for TIMER_IEN          */
#define TIMER_IEN_ICFUF0                        (0x1UL << 24)                           /**< ICFUF0 Interrupt Enable                     */
#define _TIMER_IEN_ICFUF0_SHIFT                 24                                      /**< Shift value for TIMER_ICFUF0                */
#define _TIMER_IEN_ICFUF0_MASK                  0x1000000UL                             /**< Bit mask for TIMER_ICFUF0                   */
#define _TIMER_IEN_ICFUF0_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TIMER_IEN                  */
#define TIMER_IEN_ICFUF0_DEFAULT                (_TIMER_IEN_ICFUF0_DEFAULT << 24)       /**< Shifted mode DEFAULT for TIMER_IEN          */
#define TIMER_IEN_ICFUF1                        (0x1UL << 25)                           /**< ICFUF1 Interrupt Enable                     */
#define _TIMER_IEN_ICFUF1_SHIFT                 25                                      /**< Shift value for TIMER_ICFUF1                */
#define _TIMER_IEN_ICFUF1_MASK                  0x2000000UL                             /**< Bit mask for TIMER_ICFUF1                   */
#define _TIMER_IEN_ICFUF1_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TIMER_IEN                  */
#define TIMER_IEN_ICFUF1_DEFAULT                (_TIMER_IEN_ICFUF1_DEFAULT << 25)       /**< Shifted mode DEFAULT for TIMER_IEN          */
#define TIMER_IEN_ICFUF2                        (0x1UL << 26)                           /**< ICFUF2 Interrupt Enable                     */
#define _TIMER_IEN_ICFUF2_SHIFT                 26                                      /**< Shift value for TIMER_ICFUF2                */
#define _TIMER_IEN_ICFUF2_MASK                  0x4000000UL                             /**< Bit mask for TIMER_ICFUF2                   */
#define _TIMER_IEN_ICFUF2_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TIMER_IEN                  */
#define TIMER_IEN_ICFUF2_DEFAULT                (_TIMER_IEN_ICFUF2_DEFAULT << 26)       /**< Shifted mode DEFAULT for TIMER_IEN          */

/* Bit fields for TIMER TOP */
#define _TIMER_TOP_RESETVALUE                   0x0000FFFFUL                            /**< Default value for TIMER_TOP                 */
#define _TIMER_TOP_MASK                         0xFFFFFFFFUL                            /**< Mask for TIMER_TOP                          */
#define _TIMER_TOP_TOP_SHIFT                    0                                       /**< Shift value for TIMER_TOP                   */
#define _TIMER_TOP_TOP_MASK                     0xFFFFFFFFUL                            /**< Bit mask for TIMER_TOP                      */
#define _TIMER_TOP_TOP_DEFAULT                  0x0000FFFFUL                            /**< Mode DEFAULT for TIMER_TOP                  */
#define TIMER_TOP_TOP_DEFAULT                   (_TIMER_TOP_TOP_DEFAULT << 0)           /**< Shifted mode DEFAULT for TIMER_TOP          */

/* Bit fields for TIMER TOPB */
#define _TIMER_TOPB_RESETVALUE                  0x00000000UL                            /**< Default value for TIMER_TOPB                */
#define _TIMER_TOPB_MASK                        0xFFFFFFFFUL                            /**< Mask for TIMER_TOPB                         */
#define _TIMER_TOPB_TOPB_SHIFT                  0                                       /**< Shift value for TIMER_TOPB                  */
#define _TIMER_TOPB_TOPB_MASK                   0xFFFFFFFFUL                            /**< Bit mask for TIMER_TOPB                     */
#define _TIMER_TOPB_TOPB_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TIMER_TOPB                 */
#define TIMER_TOPB_TOPB_DEFAULT                 (_TIMER_TOPB_TOPB_DEFAULT << 0)         /**< Shifted mode DEFAULT for TIMER_TOPB         */

