SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_timer.h
/* Bit fields for TIMER CNT */
#define _TIMER_CNT_RESETVALUE                   0x00000000UL                            /**< Default value for TIMER_CNT                 */
#define _TIMER_CNT_MASK                         0xFFFFFFFFUL                            /**< Mask for TIMER_CNT                          */
#define _TIMER_CNT_CNT_SHIFT                    0                                       /**< Shift value for TIMER_CNT                   */
#define _TIMER_CNT_CNT_MASK                     0xFFFFFFFFUL                            /**< Bit mask for TIMER_CNT                      */
#define _TIMER_CNT_CNT_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for TIMER_CNT                  */
#define TIMER_CNT_CNT_DEFAULT                   (_TIMER_CNT_CNT_DEFAULT << 0)           /**< Shifted mode DEFAULT for TIMER_CNT          */

/* Bit fields for TIMER LOCK */
#define _TIMER_LOCK_RESETVALUE                  0x00000000UL                            /**< Default value for TIMER_LOCK                */
#define _TIMER_LOCK_MASK                        0x0000FFFFUL                            /**< Mask for TIMER_LOCK                         */
#define _TIMER_LOCK_LOCKKEY_SHIFT               0                                       /**< Shift value for TIMER_LOCKKEY               */
#define _TIMER_LOCK_LOCKKEY_MASK                0xFFFFUL                                /**< Bit mask for TIMER_LOCKKEY                  */
#define _TIMER_LOCK_LOCKKEY_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for TIMER_LOCK                 */
#define _TIMER_LOCK_LOCKKEY_UNLOCK              0x0000CE80UL                            /**< Mode UNLOCK for TIMER_LOCK                  */
#define TIMER_LOCK_LOCKKEY_DEFAULT              (_TIMER_LOCK_LOCKKEY_DEFAULT << 0)      /**< Shifted mode DEFAULT for TIMER_LOCK         */
#define TIMER_LOCK_LOCKKEY_UNLOCK               (_TIMER_LOCK_LOCKKEY_UNLOCK << 0)       /**< Shifted mode UNLOCK for TIMER_LOCK          */

/* Bit fields for TIMER EN */
#define _TIMER_EN_RESETVALUE                    0x00000000UL                            /**< Default value for TIMER_EN                  */
#define _TIMER_EN_MASK                          0x00000003UL                            /**< Mask for TIMER_EN                           */
#define TIMER_EN_EN                             (0x1UL << 0)                            /**< Timer Module Enable                         */
#define _TIMER_EN_EN_SHIFT                      0                                       /**< Shift value for TIMER_EN                    */
#define _TIMER_EN_EN_MASK                       0x1UL                                   /**< Bit mask for TIMER_EN                       */
#define _TIMER_EN_EN_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for TIMER_EN                   */
#define TIMER_EN_EN_DEFAULT                     (_TIMER_EN_EN_DEFAULT << 0)             /**< Shifted mode DEFAULT for TIMER_EN           */
#define TIMER_EN_DISABLING                      (0x1UL << 1)                            /**< Disablement busy status                     */
#define _TIMER_EN_DISABLING_SHIFT               1                                       /**< Shift value for TIMER_DISABLING             */
#define _TIMER_EN_DISABLING_MASK                0x2UL                                   /**< Bit mask for TIMER_DISABLING                */
#define _TIMER_EN_DISABLING_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for TIMER_EN                   */
#define TIMER_EN_DISABLING_DEFAULT              (_TIMER_EN_DISABLING_DEFAULT << 1)      /**< Shifted mode DEFAULT for TIMER_EN           */

/* Bit fields for TIMER CC_CFG */
#define _TIMER_CC_CFG_RESETVALUE                0x00000000UL                            /**< Default value for TIMER_CC_CFG              */
#define _TIMER_CC_CFG_MASK                      0x003E0013UL                            /**< Mask for TIMER_CC_CFG                       */
#define _TIMER_CC_CFG_MODE_SHIFT                0                                       /**< Shift value for TIMER_MODE                  */
#define _TIMER_CC_CFG_MODE_MASK                 0x3UL                                   /**< Bit mask for TIMER_MODE                     */
#define _TIMER_CC_CFG_MODE_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for TIMER_CC_CFG               */
#define _TIMER_CC_CFG_MODE_OFF                  0x00000000UL                            /**< Mode OFF for TIMER_CC_CFG                   */
#define _TIMER_CC_CFG_MODE_INPUTCAPTURE         0x00000001UL                            /**< Mode INPUTCAPTURE for TIMER_CC_CFG          */
#define _TIMER_CC_CFG_MODE_OUTPUTCOMPARE        0x00000002UL                            /**< Mode OUTPUTCOMPARE for TIMER_CC_CFG         */
#define _TIMER_CC_CFG_MODE_PWM                  0x00000003UL                            /**< Mode PWM for TIMER_CC_CFG                   */
#define TIMER_CC_CFG_MODE_DEFAULT               (_TIMER_CC_CFG_MODE_DEFAULT << 0)       /**< Shifted mode DEFAULT for TIMER_CC_CFG       */
#define TIMER_CC_CFG_MODE_OFF                   (_TIMER_CC_CFG_MODE_OFF << 0)           /**< Shifted mode OFF for TIMER_CC_CFG           */
#define TIMER_CC_CFG_MODE_INPUTCAPTURE          (_TIMER_CC_CFG_MODE_INPUTCAPTURE << 0)  /**< Shifted mode INPUTCAPTURE for TIMER_CC_CFG  */
#define TIMER_CC_CFG_MODE_OUTPUTCOMPARE         (_TIMER_CC_CFG_MODE_OUTPUTCOMPARE << 0) /**< Shifted mode OUTPUTCOMPARE for TIMER_CC_CFG */
#define TIMER_CC_CFG_MODE_PWM                   (_TIMER_CC_CFG_MODE_PWM << 0)           /**< Shifted mode PWM for TIMER_CC_CFG           */
#define TIMER_CC_CFG_COIST                      (0x1UL << 4)                            /**< Compare Output Initial State                */
#define _TIMER_CC_CFG_COIST_SHIFT               4                                       /**< Shift value for TIMER_COIST                 */
#define _TIMER_CC_CFG_COIST_MASK                0x10UL                                  /**< Bit mask for TIMER_COIST                    */
#define _TIMER_CC_CFG_COIST_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for TIMER_CC_CFG               */
#define TIMER_CC_CFG_COIST_DEFAULT              (_TIMER_CC_CFG_COIST_DEFAULT << 4)      /**< Shifted mode DEFAULT for TIMER_CC_CFG       */
#define _TIMER_CC_CFG_INSEL_SHIFT               17                                      /**< Shift value for TIMER_INSEL                 */
#define _TIMER_CC_CFG_INSEL_MASK                0x60000UL                               /**< Bit mask for TIMER_INSEL                    */
#define _TIMER_CC_CFG_INSEL_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for TIMER_CC_CFG               */
#define _TIMER_CC_CFG_INSEL_PIN                 0x00000000UL                            /**< Mode PIN for TIMER_CC_CFG                   */
#define _TIMER_CC_CFG_INSEL_PRSSYNC             0x00000001UL                            /**< Mode PRSSYNC for TIMER_CC_CFG               */
#define _TIMER_CC_CFG_INSEL_PRSASYNCLEVEL       0x00000002UL                            /**< Mode PRSASYNCLEVEL for TIMER_CC_CFG         */
#define _TIMER_CC_CFG_INSEL_PRSASYNCPULSE       0x00000003UL                            /**< Mode PRSASYNCPULSE for TIMER_CC_CFG         */
#define TIMER_CC_CFG_INSEL_DEFAULT              (_TIMER_CC_CFG_INSEL_DEFAULT << 17)     /**< Shifted mode DEFAULT for TIMER_CC_CFG       */
#define TIMER_CC_CFG_INSEL_PIN                  (_TIMER_CC_CFG_INSEL_PIN << 17)         /**< Shifted mode PIN for TIMER_CC_CFG           */
#define TIMER_CC_CFG_INSEL_PRSSYNC              (_TIMER_CC_CFG_INSEL_PRSSYNC << 17)     /**< Shifted mode PRSSYNC for TIMER_CC_CFG       */
#define TIMER_CC_CFG_INSEL_PRSASYNCLEVEL        (_TIMER_CC_CFG_INSEL_PRSASYNCLEVEL << 17) /**< Shifted mode PRSASYNCLEVEL for TIMER_CC_CFG */
#define TIMER_CC_CFG_INSEL_PRSASYNCPULSE        (_TIMER_CC_CFG_INSEL_PRSASYNCPULSE << 17) /**< Shifted mode PRSASYNCPULSE for TIMER_CC_CFG */
#define TIMER_CC_CFG_PRSCONF                    (0x1UL << 19)                           /**< PRS Configuration                           */
#define _TIMER_CC_CFG_PRSCONF_SHIFT             19                                      /**< Shift value for TIMER_PRSCONF               */
#define _TIMER_CC_CFG_PRSCONF_MASK              0x80000UL                               /**< Bit mask for TIMER_PRSCONF                  */
#define _TIMER_CC_CFG_PRSCONF_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for TIMER_CC_CFG               */
#define _TIMER_CC_CFG_PRSCONF_PULSE             0x00000000UL                            /**< Mode PULSE for TIMER_CC_CFG                 */
#define _TIMER_CC_CFG_PRSCONF_LEVEL             0x00000001UL                            /**< Mode LEVEL for TIMER_CC_CFG                 */
#define TIMER_CC_CFG_PRSCONF_DEFAULT            (_TIMER_CC_CFG_PRSCONF_DEFAULT << 19)   /**< Shifted mode DEFAULT for TIMER_CC_CFG       */
#define TIMER_CC_CFG_PRSCONF_PULSE              (_TIMER_CC_CFG_PRSCONF_PULSE << 19)     /**< Shifted mode PULSE for TIMER_CC_CFG         */
#define TIMER_CC_CFG_PRSCONF_LEVEL              (_TIMER_CC_CFG_PRSCONF_LEVEL << 19)     /**< Shifted mode LEVEL for TIMER_CC_CFG         */
#define TIMER_CC_CFG_FILT                       (0x1UL << 20)                           /**< Digital Filter                              */
#define _TIMER_CC_CFG_FILT_SHIFT                20                                      /**< Shift value for TIMER_FILT                  */
#define _TIMER_CC_CFG_FILT_MASK                 0x100000UL                              /**< Bit mask for TIMER_FILT                     */
#define _TIMER_CC_CFG_FILT_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for TIMER_CC_CFG               */
#define _TIMER_CC_CFG_FILT_DISABLE              0x00000000UL                            /**< Mode DISABLE for TIMER_CC_CFG               */
#define _TIMER_CC_CFG_FILT_ENABLE               0x00000001UL                            /**< Mode ENABLE for TIMER_CC_CFG                */
#define TIMER_CC_CFG_FILT_DEFAULT               (_TIMER_CC_CFG_FILT_DEFAULT << 20)      /**< Shifted mode DEFAULT for TIMER_CC_CFG       */
#define TIMER_CC_CFG_FILT_DISABLE               (_TIMER_CC_CFG_FILT_DISABLE << 20)      /**< Shifted mode DISABLE for TIMER_CC_CFG       */
#define TIMER_CC_CFG_FILT_ENABLE                (_TIMER_CC_CFG_FILT_ENABLE << 20)       /**< Shifted mode ENABLE for TIMER_CC_CFG        */
#define TIMER_CC_CFG_ICFWL                      (0x1UL << 21)                           /**< Input Capture FIFO watermark level          */
#define _TIMER_CC_CFG_ICFWL_SHIFT               21                                      /**< Shift value for TIMER_ICFWL                 */
#define _TIMER_CC_CFG_ICFWL_MASK                0x200000UL                              /**< Bit mask for TIMER_ICFWL                    */
#define _TIMER_CC_CFG_ICFWL_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for TIMER_CC_CFG               */
#define TIMER_CC_CFG_ICFWL_DEFAULT              (_TIMER_CC_CFG_ICFWL_DEFAULT << 21)     /**< Shifted mode DEFAULT for TIMER_CC_CFG       */

/* Bit fields for TIMER CC_CTRL */
#define _TIMER_CC_CTRL_RESETVALUE               0x00000000UL                            /**< Default value for TIMER_CC_CTRL             */
#define _TIMER_CC_CTRL_MASK                     0x0F003F04UL                            /**< Mask for TIMER_CC_CTRL                      */
#define TIMER_CC_CTRL_OUTINV                    (0x1UL << 2)                            /**< Output Invert                               */
#define _TIMER_CC_CTRL_OUTINV_SHIFT             2                                       /**< Shift value for TIMER_OUTINV                */
#define _TIMER_CC_CTRL_OUTINV_MASK              0x4UL                                   /**< Bit mask for TIMER_OUTINV                   */
#define _TIMER_CC_CTRL_OUTINV_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for TIMER_CC_CTRL              */
#define TIMER_CC_CTRL_OUTINV_DEFAULT            (_TIMER_CC_CTRL_OUTINV_DEFAULT << 2)    /**< Shifted mode DEFAULT for TIMER_CC_CTRL      */
#define _TIMER_CC_CTRL_CMOA_SHIFT               8                                       /**< Shift value for TIMER_CMOA                  */
#define _TIMER_CC_CTRL_CMOA_MASK                0x300UL                                 /**< Bit mask for TIMER_CMOA                     */
#define _TIMER_CC_CTRL_CMOA_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for TIMER_CC_CTRL              */
#define _TIMER_CC_CTRL_CMOA_NONE                0x00000000UL                            /**< Mode NONE for TIMER_CC_CTRL                 */
#define _TIMER_CC_CTRL_CMOA_TOGGLE              0x00000001UL                            /**< Mode TOGGLE for TIMER_CC_CTRL               */
#define _TIMER_CC_CTRL_CMOA_CLEAR               0x00000002UL                            /**< Mode CLEAR for TIMER_CC_CTRL                */
#define _TIMER_CC_CTRL_CMOA_SET                 0x00000003UL                            /**< Mode SET for TIMER_CC_CTRL                  */
#define TIMER_CC_CTRL_CMOA_DEFAULT              (_TIMER_CC_CTRL_CMOA_DEFAULT << 8)      /**< Shifted mode DEFAULT for TIMER_CC_CTRL      */
#define TIMER_CC_CTRL_CMOA_NONE                 (_TIMER_CC_CTRL_CMOA_NONE << 8)         /**< Shifted mode NONE for TIMER_CC_CTRL         */
#define TIMER_CC_CTRL_CMOA_TOGGLE               (_TIMER_CC_CTRL_CMOA_TOGGLE << 8)       /**< Shifted mode TOGGLE for TIMER_CC_CTRL       */
#define TIMER_CC_CTRL_CMOA_CLEAR                (_TIMER_CC_CTRL_CMOA_CLEAR << 8)        /**< Shifted mode CLEAR for TIMER_CC_CTRL        */
#define TIMER_CC_CTRL_CMOA_SET                  (_TIMER_CC_CTRL_CMOA_SET << 8)          /**< Shifted mode SET for TIMER_CC_CTRL          */
#define _TIMER_CC_CTRL_COFOA_SHIFT              10                                      /**< Shift value for TIMER_COFOA                 */
#define _TIMER_CC_CTRL_COFOA_MASK               0xC00UL                                 /**< Bit mask for TIMER_COFOA                    */
#define _TIMER_CC_CTRL_COFOA_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for TIMER_CC_CTRL              */
#define _TIMER_CC_CTRL_COFOA_NONE               0x00000000UL                            /**< Mode NONE for TIMER_CC_CTRL                 */
#define _TIMER_CC_CTRL_COFOA_TOGGLE             0x00000001UL                            /**< Mode TOGGLE for TIMER_CC_CTRL               */
#define _TIMER_CC_CTRL_COFOA_CLEAR              0x00000002UL                            /**< Mode CLEAR for TIMER_CC_CTRL                */
#define _TIMER_CC_CTRL_COFOA_SET                0x00000003UL                            /**< Mode SET for TIMER_CC_CTRL                  */
#define TIMER_CC_CTRL_COFOA_DEFAULT             (_TIMER_CC_CTRL_COFOA_DEFAULT << 10)    /**< Shifted mode DEFAULT for TIMER_CC_CTRL      */
#define TIMER_CC_CTRL_COFOA_NONE                (_TIMER_CC_CTRL_COFOA_NONE << 10)       /**< Shifted mode NONE for TIMER_CC_CTRL         */
#define TIMER_CC_CTRL_COFOA_TOGGLE              (_TIMER_CC_CTRL_COFOA_TOGGLE << 10)     /**< Shifted mode TOGGLE for TIMER_CC_CTRL       */
#define TIMER_CC_CTRL_COFOA_CLEAR               (_TIMER_CC_CTRL_COFOA_CLEAR << 10)      /**< Shifted mode CLEAR for TIMER_CC_CTRL        */
#define TIMER_CC_CTRL_COFOA_SET                 (_TIMER_CC_CTRL_COFOA_SET << 10)        /**< Shifted mode SET for TIMER_CC_CTRL          */
#define _TIMER_CC_CTRL_CUFOA_SHIFT              12                                      /**< Shift value for TIMER_CUFOA                 */
#define _TIMER_CC_CTRL_CUFOA_MASK               0x3000UL                                /**< Bit mask for TIMER_CUFOA                    */
#define _TIMER_CC_CTRL_CUFOA_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for TIMER_CC_CTRL              */
#define _TIMER_CC_CTRL_CUFOA_NONE               0x00000000UL                            /**< Mode NONE for TIMER_CC_CTRL                 */
#define _TIMER_CC_CTRL_CUFOA_TOGGLE             0x00000001UL                            /**< Mode TOGGLE for TIMER_CC_CTRL               */
#define _TIMER_CC_CTRL_CUFOA_CLEAR              0x00000002UL                            /**< Mode CLEAR for TIMER_CC_CTRL                */
#define _TIMER_CC_CTRL_CUFOA_SET                0x00000003UL                            /**< Mode SET for TIMER_CC_CTRL                  */
#define TIMER_CC_CTRL_CUFOA_DEFAULT             (_TIMER_CC_CTRL_CUFOA_DEFAULT << 12)    /**< Shifted mode DEFAULT for TIMER_CC_CTRL      */
#define TIMER_CC_CTRL_CUFOA_NONE                (_TIMER_CC_CTRL_CUFOA_NONE << 12)       /**< Shifted mode NONE for TIMER_CC_CTRL         */
#define TIMER_CC_CTRL_CUFOA_TOGGLE              (_TIMER_CC_CTRL_CUFOA_TOGGLE << 12)     /**< Shifted mode TOGGLE for TIMER_CC_CTRL       */
#define TIMER_CC_CTRL_CUFOA_CLEAR               (_TIMER_CC_CTRL_CUFOA_CLEAR << 12)      /**< Shifted mode CLEAR for TIMER_CC_CTRL        */
#define TIMER_CC_CTRL_CUFOA_SET                 (_TIMER_CC_CTRL_CUFOA_SET << 12)        /**< Shifted mode SET for TIMER_CC_CTRL          */
#define _TIMER_CC_CTRL_ICEDGE_SHIFT             24                                      /**< Shift value for TIMER_ICEDGE                */
#define _TIMER_CC_CTRL_ICEDGE_MASK              0x3000000UL                             /**< Bit mask for TIMER_ICEDGE                   */
#define _TIMER_CC_CTRL_ICEDGE_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for TIMER_CC_CTRL              */
#define _TIMER_CC_CTRL_ICEDGE_RISING            0x00000000UL                            /**< Mode RISING for TIMER_CC_CTRL               */
#define _TIMER_CC_CTRL_ICEDGE_FALLING           0x00000001UL                            /**< Mode FALLING for TIMER_CC_CTRL              */
#define _TIMER_CC_CTRL_ICEDGE_BOTH              0x00000002UL                            /**< Mode BOTH for TIMER_CC_CTRL                 */
#define _TIMER_CC_CTRL_ICEDGE_NONE              0x00000003UL                            /**< Mode NONE for TIMER_CC_CTRL                 */
#define TIMER_CC_CTRL_ICEDGE_DEFAULT            (_TIMER_CC_CTRL_ICEDGE_DEFAULT << 24)   /**< Shifted mode DEFAULT for TIMER_CC_CTRL      */
#define TIMER_CC_CTRL_ICEDGE_RISING             (_TIMER_CC_CTRL_ICEDGE_RISING << 24)    /**< Shifted mode RISING for TIMER_CC_CTRL       */
#define TIMER_CC_CTRL_ICEDGE_FALLING            (_TIMER_CC_CTRL_ICEDGE_FALLING << 24)   /**< Shifted mode FALLING for TIMER_CC_CTRL      */
#define TIMER_CC_CTRL_ICEDGE_BOTH               (_TIMER_CC_CTRL_ICEDGE_BOTH << 24)      /**< Shifted mode BOTH for TIMER_CC_CTRL         */
#define TIMER_CC_CTRL_ICEDGE_NONE               (_TIMER_CC_CTRL_ICEDGE_NONE << 24)      /**< Shifted mode NONE for TIMER_CC_CTRL         */
#define _TIMER_CC_CTRL_ICEVCTRL_SHIFT           26                                      /**< Shift value for TIMER_ICEVCTRL              */
#define _TIMER_CC_CTRL_ICEVCTRL_MASK            0xC000000UL                             /**< Bit mask for TIMER_ICEVCTRL                 */
#define _TIMER_CC_CTRL_ICEVCTRL_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for TIMER_CC_CTRL              */
#define _TIMER_CC_CTRL_ICEVCTRL_EVERYEDGE       0x00000000UL                            /**< Mode EVERYEDGE for TIMER_CC_CTRL            */
#define _TIMER_CC_CTRL_ICEVCTRL_EVERYSECONDEDGE 0x00000001UL                            /**< Mode EVERYSECONDEDGE for TIMER_CC_CTRL      */
#define _TIMER_CC_CTRL_ICEVCTRL_RISING          0x00000002UL                            /**< Mode RISING for TIMER_CC_CTRL               */
#define _TIMER_CC_CTRL_ICEVCTRL_FALLING         0x00000003UL                            /**< Mode FALLING for TIMER_CC_CTRL              */
#define TIMER_CC_CTRL_ICEVCTRL_DEFAULT          (_TIMER_CC_CTRL_ICEVCTRL_DEFAULT << 26) /**< Shifted mode DEFAULT for TIMER_CC_CTRL      */
#define TIMER_CC_CTRL_ICEVCTRL_EVERYEDGE        (_TIMER_CC_CTRL_ICEVCTRL_EVERYEDGE << 26) /**< Shifted mode EVERYEDGE for TIMER_CC_CTRL    */
#define TIMER_CC_CTRL_ICEVCTRL_EVERYSECONDEDGE  (_TIMER_CC_CTRL_ICEVCTRL_EVERYSECONDEDGE << 26) /**< Shifted mode EVERYSECONDEDGE for TIMER_CC_CTRL*/
#define TIMER_CC_CTRL_ICEVCTRL_RISING           (_TIMER_CC_CTRL_ICEVCTRL_RISING << 26)  /**< Shifted mode RISING for TIMER_CC_CTRL       */
#define TIMER_CC_CTRL_ICEVCTRL_FALLING          (_TIMER_CC_CTRL_ICEVCTRL_FALLING << 26) /**< Shifted mode FALLING for TIMER_CC_CTRL      */

/* Bit fields for TIMER CC_OC */
#define _TIMER_CC_OC_RESETVALUE                 0x00000000UL                            /**< Default value for TIMER_CC_OC               */
#define _TIMER_CC_OC_MASK                       0xFFFFFFFFUL                            /**< Mask for TIMER_CC_OC                        */
#define _TIMER_CC_OC_OC_SHIFT                   0                                       /**< Shift value for TIMER_OC                    */
#define _TIMER_CC_OC_OC_MASK                    0xFFFFFFFFUL                            /**< Bit mask for TIMER_OC                       */
#define _TIMER_CC_OC_OC_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for TIMER_CC_OC                */
#define TIMER_CC_OC_OC_DEFAULT                  (_TIMER_CC_OC_OC_DEFAULT << 0)          /**< Shifted mode DEFAULT for TIMER_CC_OC        */

