SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_timer.h
/* Bit fields for TIMER CC_OCB */
#define _TIMER_CC_OCB_RESETVALUE                0x00000000UL                            /**< Default value for TIMER_CC_OCB              */
#define _TIMER_CC_OCB_MASK                      0xFFFFFFFFUL                            /**< Mask for TIMER_CC_OCB                       */
#define _TIMER_CC_OCB_OCB_SHIFT                 0                                       /**< Shift value for TIMER_OCB                   */
#define _TIMER_CC_OCB_OCB_MASK                  0xFFFFFFFFUL                            /**< Bit mask for TIMER_OCB                      */
#define _TIMER_CC_OCB_OCB_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TIMER_CC_OCB               */
#define TIMER_CC_OCB_OCB_DEFAULT                (_TIMER_CC_OCB_OCB_DEFAULT << 0)        /**< Shifted mode DEFAULT for TIMER_CC_OCB       */

/* Bit fields for TIMER CC_ICF */
#define _TIMER_CC_ICF_RESETVALUE                0x00000000UL                            /**< Default value for TIMER_CC_ICF              */
#define _TIMER_CC_ICF_MASK                      0xFFFFFFFFUL                            /**< Mask for TIMER_CC_ICF                       */
#define _TIMER_CC_ICF_ICF_SHIFT                 0                                       /**< Shift value for TIMER_ICF                   */
#define _TIMER_CC_ICF_ICF_MASK                  0xFFFFFFFFUL                            /**< Bit mask for TIMER_ICF                      */
#define _TIMER_CC_ICF_ICF_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TIMER_CC_ICF               */
#define TIMER_CC_ICF_ICF_DEFAULT                (_TIMER_CC_ICF_ICF_DEFAULT << 0)        /**< Shifted mode DEFAULT for TIMER_CC_ICF       */

/* Bit fields for TIMER CC_ICOF */
#define _TIMER_CC_ICOF_RESETVALUE               0x00000000UL                            /**< Default value for TIMER_CC_ICOF             */
#define _TIMER_CC_ICOF_MASK                     0xFFFFFFFFUL                            /**< Mask for TIMER_CC_ICOF                      */
#define _TIMER_CC_ICOF_ICOF_SHIFT               0                                       /**< Shift value for TIMER_ICOF                  */
#define _TIMER_CC_ICOF_ICOF_MASK                0xFFFFFFFFUL                            /**< Bit mask for TIMER_ICOF                     */
#define _TIMER_CC_ICOF_ICOF_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for TIMER_CC_ICOF              */
#define TIMER_CC_ICOF_ICOF_DEFAULT              (_TIMER_CC_ICOF_ICOF_DEFAULT << 0)      /**< Shifted mode DEFAULT for TIMER_CC_ICOF      */

/* Bit fields for TIMER DTCFG */
#define _TIMER_DTCFG_RESETVALUE                 0x00000000UL                            /**< Default value for TIMER_DTCFG               */
#define _TIMER_DTCFG_MASK                       0x00000E03UL                            /**< Mask for TIMER_DTCFG                        */
#define TIMER_DTCFG_DTEN                        (0x1UL << 0)                            /**< DTI Enable                                  */
#define _TIMER_DTCFG_DTEN_SHIFT                 0                                       /**< Shift value for TIMER_DTEN                  */
#define _TIMER_DTCFG_DTEN_MASK                  0x1UL                                   /**< Bit mask for TIMER_DTEN                     */
#define _TIMER_DTCFG_DTEN_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TIMER_DTCFG                */
#define TIMER_DTCFG_DTEN_DEFAULT                (_TIMER_DTCFG_DTEN_DEFAULT << 0)        /**< Shifted mode DEFAULT for TIMER_DTCFG        */
#define TIMER_DTCFG_DTDAS                       (0x1UL << 1)                            /**< DTI Automatic Start-up Functionality        */
#define _TIMER_DTCFG_DTDAS_SHIFT                1                                       /**< Shift value for TIMER_DTDAS                 */
#define _TIMER_DTCFG_DTDAS_MASK                 0x2UL                                   /**< Bit mask for TIMER_DTDAS                    */
#define _TIMER_DTCFG_DTDAS_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for TIMER_DTCFG                */
#define _TIMER_DTCFG_DTDAS_NORESTART            0x00000000UL                            /**< Mode NORESTART for TIMER_DTCFG              */
#define _TIMER_DTCFG_DTDAS_RESTART              0x00000001UL                            /**< Mode RESTART for TIMER_DTCFG                */
#define TIMER_DTCFG_DTDAS_DEFAULT               (_TIMER_DTCFG_DTDAS_DEFAULT << 1)       /**< Shifted mode DEFAULT for TIMER_DTCFG        */
#define TIMER_DTCFG_DTDAS_NORESTART             (_TIMER_DTCFG_DTDAS_NORESTART << 1)     /**< Shifted mode NORESTART for TIMER_DTCFG      */
#define TIMER_DTCFG_DTDAS_RESTART               (_TIMER_DTCFG_DTDAS_RESTART << 1)       /**< Shifted mode RESTART for TIMER_DTCFG        */
#define TIMER_DTCFG_DTAR                        (0x1UL << 9)                            /**< DTI Always Run                              */
#define _TIMER_DTCFG_DTAR_SHIFT                 9                                       /**< Shift value for TIMER_DTAR                  */
#define _TIMER_DTCFG_DTAR_MASK                  0x200UL                                 /**< Bit mask for TIMER_DTAR                     */
#define _TIMER_DTCFG_DTAR_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TIMER_DTCFG                */
#define TIMER_DTCFG_DTAR_DEFAULT                (_TIMER_DTCFG_DTAR_DEFAULT << 9)        /**< Shifted mode DEFAULT for TIMER_DTCFG        */
#define TIMER_DTCFG_DTFATS                      (0x1UL << 10)                           /**< DTI Fault Action on Timer Stop              */
#define _TIMER_DTCFG_DTFATS_SHIFT               10                                      /**< Shift value for TIMER_DTFATS                */
#define _TIMER_DTCFG_DTFATS_MASK                0x400UL                                 /**< Bit mask for TIMER_DTFATS                   */
#define _TIMER_DTCFG_DTFATS_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for TIMER_DTCFG                */
#define TIMER_DTCFG_DTFATS_DEFAULT              (_TIMER_DTCFG_DTFATS_DEFAULT << 10)     /**< Shifted mode DEFAULT for TIMER_DTCFG        */
#define TIMER_DTCFG_DTPRSEN                     (0x1UL << 11)                           /**< DTI PRS Source Enable                       */
#define _TIMER_DTCFG_DTPRSEN_SHIFT              11                                      /**< Shift value for TIMER_DTPRSEN               */
#define _TIMER_DTCFG_DTPRSEN_MASK               0x800UL                                 /**< Bit mask for TIMER_DTPRSEN                  */
#define _TIMER_DTCFG_DTPRSEN_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for TIMER_DTCFG                */
#define TIMER_DTCFG_DTPRSEN_DEFAULT             (_TIMER_DTCFG_DTPRSEN_DEFAULT << 11)    /**< Shifted mode DEFAULT for TIMER_DTCFG        */

